# StartNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
NumericRevisionSettings..::..StartNumber Property
NumericRevisionSettings Class See Also
---
The start number for the sequence.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int StartNumber { get; set; }
```

Visual Basic
---
```text
Public Property StartNumber As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int StartNumber {
	int get ();
	void set (int value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for number is negative. |

# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace